import app from "../utils/axiosConfig";
import { useEffect, useState } from 'react';

function Post() {
    const [post, setPost] = useState({});

    const getPost = async () => {
        try {
            const postId = window.location.pathname.split('/').pop();
            const response = await app.get(`http://localhost:3033/news/${postId}`);
            setPost(response.data[0]);
            console.log(response.data);
        } catch (error) {
            console.error(error);
        }
    };

    useEffect(() => {
        getPost();
    }, []);

    return (
        <div className="container mx-auto">
            <div className="">
                <div className="flex flex-col justify-between gap-4 w-3/4">
                    <div className="flex flex-col justify-between p-4 gap-4 bg-gray rounded-[20px]">
                        <h1>{post.theme}</h1>
                        <img src={post?.title_img} alt="img" className="max-h-[598px] w-full object-cover rounded-[20px]"/>
                        <div className="flex justify-center gap-16">
                            <div className="flex justify-center gap-2 items-center">
                                <svg width="18" height="20" viewBox="0 0 18 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M4.53125 2.5H8.46875V1.40625C8.46875 1.05078 8.74219 0.75 9.125 0.75C9.48047 0.75 9.78125 1.05078 9.78125 1.40625V2.5H10.875C11.832 2.5 12.625 3.29297 12.625 4.25V13C12.625 13.9844 11.832 14.75 10.875 14.75H2.125C1.14062 14.75 0.375 13.9844 0.375 13V4.25C0.375 3.29297 1.14062 2.5 2.125 2.5H3.21875V1.40625C3.21875 1.05078 3.49219 0.75 3.875 0.75C4.23047 0.75 4.53125 1.05078 4.53125 1.40625V2.5ZM1.6875 13C1.6875 13.2461 1.87891 13.4375 2.125 13.4375H10.875C11.0938 13.4375 11.3125 13.2461 11.3125 13V6H1.6875V13Z" fill="#3E3232" fillOpacity="0.5"/>
                                </svg>
                                <p>{post?.created_at_date}</p>
                            </div>
                            <div className="flex justify-center gap-2 items-center">
                                <svg width="20" height="18" viewBox="0 0 20 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M4.4375 5.4375C4.90234 5.4375 5.28516 5.84766 5.28516 6.3125C5.28516 6.80469 4.90234 7.1875 4.4375 7.1875C3.94531 7.1875 3.5625 6.80469 3.5625 6.3125C3.5625 5.84766 3.94531 5.4375 4.4375 5.4375ZM7.5 5.4375C7.96484 5.4375 8.34766 5.84766 8.34766 6.3125C8.34766 6.75 7.9375 7.16016 7.5 7.16016C7.03516 7.16016 6.625 6.77734 6.625 6.3125C6.625 5.82031 7.00781 5.4375 7.5 5.4375ZM10.5625 5.4375C11.0273 5.4375 11.4375 5.84766 11.4102 6.3125C11.4102 6.80469 11.0273 7.1875 10.5625 7.1875C10.0977 7.1875 9.6875 6.80469 9.6875 6.3125C9.6875 5.84766 10.0703 5.4375 10.5625 5.4375ZM7.5 0.625C11.3555 0.625 14.4727 3.22266 14.4727 6.33984C14.4727 9.45703 11.3555 12 7.5 12C6.59766 12 5.72266 11.8633 4.95703 11.6172C4.13672 12.1914 2.82422 12.875 1.15625 12.875C0.882812 12.875 0.636719 12.7383 0.554688 12.4648C0.472656 12.2188 0.5 11.9453 0.691406 11.7539C0.691406 11.7539 1.53906 10.8242 1.94922 9.75781C1.04688 8.80078 0.5 7.59766 0.5 6.3125C0.5 3.16797 3.61719 0.625 7.5 0.625ZM7.5 10.6875C10.6172 10.6875 13.1328 8.74609 13.1328 6.3125C13.1328 3.90625 10.5898 1.9375 7.47266 1.9375C4.35547 1.9375 1.8125 3.90625 1.8125 6.3125C1.8125 7.48828 2.38672 8.36328 2.87891 8.88281L3.45312 9.48438L3.15234 10.25C3.01562 10.6328 2.82422 11.0156 2.60547 11.3438C3.26172 11.125 3.80859 10.8242 4.19141 10.5508L4.71094 10.168L5.33984 10.3594C6.02344 10.5781 6.76172 10.6875 7.5 10.6875Z" fill="#3E3232" fillOpacity="0.5"/>
                                </svg>
                                <p>Комментариев: COUNT OF COMMENTS</p>
                            </div>
                            <div className="flex justify-center gap-2 items-center">
                                <svg width="20" height="18" viewBox="0 0 20 18" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M12.7227 2.375C13.707 2.375 14.4727 3.16797 14.4727 4.125V11.125C14.4727 12.1094 13.6797 12.875 12.7227 12.875H2.22266C1.23828 12.875 0.472656 12.1094 0.472656 11.125V2.375C0.472656 1.41797 1.23828 0.625 2.22266 0.625H5.44922C5.91406 0.625 6.35156 0.816406 6.67969 1.14453L8.01953 2.375H12.7227ZM13.1602 11.125V4.125C13.1602 3.90625 12.9414 3.6875 12.7227 3.6875H7.47266L5.72266 2.07422C5.64062 1.99219 5.53125 1.9375 5.42188 1.9375H2.22266C1.97656 1.9375 1.78516 2.15625 1.78516 2.375V11.125C1.78516 11.3711 1.97656 11.5625 2.22266 11.5625H12.7227C12.9414 11.5625 13.1602 11.3711 13.1602 11.125Z" fill="#3E3232" fillOpacity="0.5"/>
                                </svg>
                                <p>Категория: { post.category }</p>
                            </div>
                        </div>
                    </div>
                    <p className="p-4">{post?.text}</p>
                </div>
                <div className="w-1/4">
                </div>
            </div>
        </div>
    )
}

export default Post